# First print your name in the cell below then save this file. (or something nice about your instructor)

In [1]:
# In this cell print your name 
print("Albert Bagdasarov")

Albert Bagdasarov

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [137]:
import pandas as pd
import numpy as np
import glob
import os

# Load in the data file using `pd.read_csv()`

In [3]:
# Load data here
df = pd.read_csv("../data/listings.csv")

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [4]:
# lets look at the data
df.head(2)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265

In [5]:
# 1. How many listings are there with a price less than 100? 

df[df['price'] < 100].shape[0] # sorting by condition and then taking number of rows through shape which returns (rows,columns)

22778

In [6]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.

df_bk = df[df['neighbourhood_group'] == 'Brooklyn']
df_bk['id'].count() # counting listings by "id" column as unique identifier

18632

In [7]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

df_bk[df_bk['price'] < 100].shape[0]

10473

In [8]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names
df[df['host_name'].isin(["Michael","David","John","Daniel"])]['id'].count()

1258

In [9]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 

df['adjusted_price'] = np.where(
    df['neighbourhood'] == 'Williamsburg', # If neighbourhood == "Williamsburg"
    df['price'] + 100, # THEN price + 100
    df['price'] # Else keep original price
)

In [10]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
private_room_percentage = df[df['room_type'] == 'Private room']['id'].count()  / df['room_type'].count() * 100
shared_room_percentage  = df[df['room_type'] == 'Shared room']['id'].count() / df['room_type'].count() * 100

In [11]:
print(private_room_percentage)
print(shared_room_percentage)

45.444580566122895
2.12134889419047

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [12]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

df.groupby('neighbourhood_group').agg({'id':'count'}).rename(columns={'id': 'listings_count'}).reset_index()

  neighbourhood_group  listings_count
0               Bronx            1183
1            Brooklyn           18632
2           Manhattan           20580
3              Queens            5791
4       Staten Island             341

In [13]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 

df.groupby('neighbourhood_group').agg({'price':'mean'}).rename(columns={'price':'avg_price'}).reset_index()

  neighbourhood_group   avg_price
0               Bronx   92.751479
1            Brooklyn  120.225258
2           Manhattan  191.880466
3              Queens   99.754965
4       Staten Island  110.947214

In [14]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
df.groupby('room_type').agg({'price':'mean'}).rename(columns={'price':'avg_price'}).reset_index()

         room_type   avg_price
0  Entire home/apt  199.395950
1       Hotel room  275.015075
2     Private room   91.453084
3      Shared room   87.063830

In [15]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 
df.groupby('neighbourhood_group').agg(
    min_price=("price", "min"),
    max_price=("price", "max")).reset_index()

  neighbourhood_group  min_price  max_price
0               Bronx         16       1404
1            Brooklyn          0      10000
2           Manhattan          0      10000
3              Queens          0      10000
4       Staten Island         19       1200

In [16]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.
df.groupby(['neighbourhood_group', 'room_type']).agg(
    mean_price=("price", "mean")).reset_index()

   neighbourhood_group        room_type  mean_price
0                Bronx  Entire home/apt  138.004819
1                Bronx     Private room   68.419668
2                Bronx      Shared room   66.391304
3             Brooklyn  Entire home/apt  171.587687
4             Brooklyn       Hotel room  147.300000
5             Brooklyn     Private room   71.291189
6             Brooklyn      Shared room   57.870091
7            Manhattan  Entire home/apt  231.335572
8            Manhattan       Hotel room  292.515670
9            Manhattan     Private room  128.277069
10           Manhattan      Shared room  111.735084
11              Queens  Entire home/apt  150.168900
12              Queens       Hotel room  139.058824
13              Queens     Private room   69.972564
14              Queens      Shared room   89.891892
15       Staten Island  Entire home/apt  151.720930
16       Staten Island     Private room   70.312883
17       Staten Island      Shared room   46.000000

In [17]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.
df.groupby(['neighbourhood_group', 'room_type'])['price'].describe().reset_index() # no need in agg

,neighbourhood_group,room_type,count,mean,std,min,25%,50%,75%,max
0,Bronx,Entire home/apt,415.0,138.004819,126.032106,25.0,80.00,103.0,150.00,1404.0
1,Bronx,Private room,722.0,68.419668,57.337866,16.0,45.00,55.0,71.00,700.0
2,Bronx,Shared room,46.0,66.391304,114.442703,20.0,25.25,44.0,69.75,800.0
3,Brooklyn,Entire home/apt,9112.0,171.587687,236.732843,20.0,100.00,135.0,189.00,10000.0
4,Brooklyn,Hotel room,30.0,147.300000,91.153206,0.0,110.00,129.0,161.50,399.0
5,Brooklyn,Private room,9159.0,71.291189,69.023165,10.0,45.00,60.0,80.00,2500.0
6,Brooklyn,Shared room,331.0,57.870091,92.217618,15.0,25.00,36.0,60.00,1500.0
7,Manhattan,Entire home/apt,12209.0,231.335572,410.306439,0.0,120.00,165.0,240.00,10000.0
8,Manhattan,Hotel room,351.0,292.515670,315.924085,0.0,98.00,210.0,311.50,2211.0
9,Manhattan,Private room,7601.0,128.277069,448.677306,10.0,59.00,80.0,112.00,10000.0
10,Manhattan,Shared room,419.0,111.735084,502.728868,10.0,40.00,60.0,85.00,10000.0
11,Queens,Entire home/apt,2090.0,150.168900,252.606739,10.0,89.00,115.0,159.00,10000.0
12,Queens,Hotel room,17.0,139.058824,50.743806,0.0,132.00,149.0,149.00,249.0
13,Queens,Private room,3499.0,69.972564,163.814468,18.0,43.00,55.0,75.00,9000.0
14,Queens,Shared room,185.0,89.891892,275.675158,14.0,30.00,40.0,60.00,3000.0
15,Staten Island,Entire home/apt,172.0,151.720930,147.518392,39.0,82.75,111.0,150.00,1200.0
16,Staten Island,Private room,163.0,70.312883,70.759593,20.0,42.00,55.0,71.50,800.0
17,Staten Island,Shared room,6.0,46.000000,28.446441,19.0,22.50,38.0,70.75,82.0

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [18]:
# 1. Load the `prices.csv` and the `n_listings.csv`
prices = pd.read_csv("../data/prices.csv")
n_listings = pd.read_csv("../data/n_listings.csv")

In [19]:
n_listings.head()

  neighbourhood_group;n_listings
0                     Bronx;1183
1                 Brooklyn;18632
2                Manhattan;20580
3                LongIsland;4121

In [20]:
prices.head()

  neighbourhood_group   mean_price
0               Bronx    92.751479
1            Brooklyn   120.225258
2           Manhattan   191.880466
3              Queens    99.754965
4       Staten Island   110.947214

In [21]:
# 2. Do join that keeps all the records for each table.
print(prices.shape)
print(n_listings.shape)

(5, 2)
(4, 1)

**Seems like we have two problems**
1)  The number of rows for both datasets are different we may have some problems with merging them \
2)  Categorical and numerical columns in n_listings are stacked together as one column, we need to separae them

In [22]:
# separatig the string using split by ';'
# 'expand = true' returns result as separated columns 
n_listings[['neighbourhood_group', 'n_listings']] = n_listings['neighbourhood_group;n_listings'].str.split(';', expand=True)

In [23]:
# dropping unnecessary column
n_listings = n_listings.drop(['neighbourhood_group;n_listings'], axis = 1)

In [24]:
n_listings

  neighbourhood_group n_listings
0               Bronx       1183
1            Brooklyn      18632
2           Manhattan      20580
3          LongIsland       4121

In [25]:
# neighbourhood_group is the common column for both tables
# I decided to use outer join since it  will include records that matches from either of the tables, which means we won't loose any records
joined_df = prices.merge(n_listings, on='neighbourhood_group', how='outer')

In [26]:
joined_df

  neighbourhood_group   mean_price n_listings
0               Bronx    92.751479       1183
1            Brooklyn   120.225258      18632
2           Manhattan   191.880466      20580
3              Queens    99.754965        NaN
4       Staten Island   110.947214        NaN
5          LongIsland          NaN       4121

In [27]:
# lets fill empty values 
correct_df = df.groupby('neighbourhood_group').agg({'id':'count'}).rename(columns={'id':'n_listings'}).reset_index()

In [28]:
correct_df[correct_df['neighbourhood_group'] == 'Queens']

  neighbourhood_group  n_listings
3              Queens        5791

In [29]:
joined_df.loc[joined_df['neighbourhood_group'] == 'Queens', 'n_listings'] = correct_df.loc[correct_df['neighbourhood_group'] == 'Queens', 'n_listings'].values[0]
joined_df.loc[joined_df['neighbourhood_group'] == 'Staten Island', 'n_listings'] = correct_df.loc[correct_df['neighbourhood_group'] == 'Staten Island', 'n_listings'].values[0]

Seems like no records for longisland

In [30]:
joined_df = joined_df.fillna(0)

In [31]:
joined_df

  neighbourhood_group   mean_price n_listings
0               Bronx    92.751479       1183
1            Brooklyn   120.225258      18632
2           Manhattan   191.880466      20580
3              Queens    99.754965       5791
4       Staten Island   110.947214        341
5          LongIsland     0.000000       4121

In [32]:
# 3. Save your joined csv as `joined.csv` into the data folder.
joined_df.to_csv("../data/joined.csv", index=False)

In [33]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`
pd.read_csv("../data/joined.csv")

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479        1183
1            Brooklyn   120.225258       18632
2           Manhattan   191.880466       20580
3              Queens    99.754965        5791
4       Staten Island   110.947214         341
5          LongIsland     0.000000        4121

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

In [34]:
from pandasai import SmartDataframe
from pandasai.llm import OpenAI
import pandas as pd

df = pd.read_csv("../data/listings.csv")

# Wrap it with PandasAI
#llm = OpenAI(api_token="")  # you need an API key
#sdf = SmartDataframe(df, config={"llm": llm})

Not working for me :(

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

In [35]:
gram = pd.read_csv("../data/grammys.csv")

In [39]:
gram.head(3)

,year,category,nominee,workers,winner
0,1959,Album of the Year,The Music from Peter Gunn.,Henry Mancini,True
1,1959,Best Album Cover,Only the Lonely,Frank Sinatra (art director),True
2,1959,Best Arrangement,The Music From Peter Gunn,Henry Mancini (artist/arranger),True

**Who was won Album of the Year in 2016?**

In [46]:
gram[(gram['year'] == 2016) & 
     (gram['winner'] == True) & 
     (gram['category'] == 'Album of the Year')]

,year,category,nominee,workers,winner
5505,2016,Album of the Year,1989.,"Taylor Swift (artist/producer), Jack Antonoff ...",True

**Who won Best Rap Album in 2009?**

In [56]:
gram[(gram['year'] == 2009) & 
     (gram['winner'] == True) & 
     (gram['category'] == 'Best Rap Album')]

      year        category         nominee     workers  winner
4396  2009  Best Rap Album  Tha Carter III  Lil' Wayne    True

**How many awards was Kendrick Lamar nomiated for, and how many did he win...?**

In [70]:
no_win = gram[(gram['workers'] == 'Kendrick Lamar') & (gram['winner'] == False)].shape[0]
win = gram[(gram['workers'] == 'Kendrick Lamar') & (gram['winner'] == True)].shape[0]

print(no_win, " - Did not win")
print(win, " - Won")
print(no_win+win, "- Total nominations")

2  - Did not win
4  - Won
6 - Total nominations

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

In [133]:
df = pd.read_csv("../data/gl2022.txt", sep=",", header = None)

In [134]:
# assigning columns
df_columns = pd.read_csv("../data/columns.txt")

In [135]:
df.columns = df_columns.columns

In [136]:
df

,Date,DoubleHeader,DayOfWeek,VisitingTeam,VisitingTeamLeague,VisitingTeamGameNumber,HomeTeam,HomeTeamLeague,HomeTeamGameNumber,VisitorRunsScored,...,HomeBatting7Name,HomeBatting7Position,HomeBatting8PlayerID,HomeBatting8Name,HomeBatting8Position,HomeBatting9PlayerID,HomeBatting9Name,HomeBatting9Position,AdditionalInfo,AcquisitionInfo
0,20220407,0,Thu,SDN,NL,1,ARI,NL,1,2,...,Seth Beer,10,ellid002,Drew Ellis,5,perdg001,Gerardo Perdomo,6,NaN,Y
1,20220407,0,Thu,CIN,NL,1,ATL,NL,1,6,...,Travis d'Arnaud,2,dicka001,Alex Dickerson,10,swand001,Dansby Swanson,6,NaN,Y
2,20220407,0,Thu,MIL,NL,1,CHN,NL,1,4,...,Jason Heyward,8,wisdp001,Patrick Wisdom,5,hoern001,Nico Hoerner,6,NaN,Y
3,20220407,0,Thu,PIT,NL,1,SLN,NL,1,0,...,Yadier Molina,2,badeh001,Harrison Bader,8,edmat001,Tommy Edman,4,NaN,Y
4,20220407,0,Thu,NYN,NL,1,WAS,NL,1,5,...,Maikel Franco,5,escoa003,Alcides Escobar,6,roblv001,Victor Robles,8,NaN,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2425,20221005,0,Wed,KCA,AL,162,CLE,AL,162,2,...,Will Brennan,7,maill001,Luke Maile,2,stram002,Myles Straw,8,NaN,Y
2426,20221005,0,Wed,PHI,NL,162,HOU,AL,162,2,...,Jake Meyers,8,dubom001,Mauricio Dubon,6,maldm001,Martin Maldonado,2,NaN,Y
2427,20221005,0,Wed,ANA,AL,162,OAK,AL,162,2,...,Conner Capel,9,garcd004,Dermis Garcia,3,allen002,Nick Allen,6,NaN,Y
2428,20221005,0,Wed,DET,AL,162,SEA,AL,162,4,...,Abraham Toro,5,casac001,Curt Casali,2,crawj002,J.P. Crawford,6,NaN,Y
2429,20221005,0,Wed,NYA,AL,162,TEX,AL,162,2,...,Charlie Culberson,7,tavel001,Leody Taveras,8,thomb003,Bubba Thompson,9,NaN,Y

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.

In [140]:
# get all .txt files in the folder
files = glob.glob(os.path.join("../data/", "*.txt"))

In [141]:
files

['../data\\columns.txt',
 '../data\\gl2020.txt',
 '../data\\gl2021.txt',
 '../data\\gl2022.txt',
 '../data\\gl2023.txt',
 '../data\\gl2024.txt']

In [150]:
dfs = [] # list of pandas dataFrames
for file in files: # looping through all txt file names
    if "gl" in file: # checking for keyword within file name to make sure it is game records
        df = pd.read_csv(file, names = df_columns.columns)
        dfs.append(df)

In [151]:
# concatenate into one DataFrame
all_data = pd.concat(dfs, ignore_index=True)

In [152]:
all_data

,Date,DoubleHeader,DayOfWeek,VisitingTeam,VisitingTeamLeague,VisitingTeamGameNumber,HomeTeam,HomeTeamLeague,HomeTeamGameNumber,VisitorRunsScored,...,HomeBatting7Name,HomeBatting7Position,HomeBatting8PlayerID,HomeBatting8Name,HomeBatting8Position,HomeBatting9PlayerID,HomeBatting9Name,HomeBatting9Position,AdditionalInfo,AcquisitionInfo
0,20200723,0,Thu,SFN,NL,1,LAN,NL,1,1,...,Joc Pederson,7,polla001,A.J. Pollock,10,barna001,Austin Barnes,2,NaN,Y
1,20200723,0,Thu,NYA,AL,1,WAS,NL,1,4,...,Asdrubal Cabrera,5,steva001,Andrew Stevenson,7,roblv001,Victor Robles,8,NaN,Y
2,20200724,0,Fri,MIL,NL,1,CHN,NL,1,0,...,Victor Caratini,10,hoern001,Nico Hoerner,4,happi001,Ian Happ,8,NaN,Y
3,20200724,0,Fri,DET,AL,1,CIN,NL,1,1,...,Nick Senzel,8,galvf001,Freddy Galvis,6,casac001,Curt Casali,2,NaN,Y
4,20200724,0,Fri,SFN,NL,2,LAN,NL,2,1,...,Chris Taylor,7,pedej001,Joc Pederson,10,smitw003,Will Smith,2,NaN,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10611,20240929,0,Sun,PIT,NL,162,NYA,AL,162,4,...,Anthony Volpe,6,riceb001,Ben Rice,3,trevj001,Jose Trevino,2,NaN,Y
10612,20240929,0,Sun,OAK,AL,162,SEA,AL,162,4,...,Jorge Polanco,4,crawj002,J.P. Crawford,6,rojaj001,Josh Rojas,5,NaN,Y
10613,20240929,0,Sun,MIA,NL,162,TOR,AL,162,3,...,Steward Berroa,9,lopej008,Joey Loperfido,7,heint001,Tyler Heineman,2,NaN,Y
10614,20240930,1,Mon,NYN,NL,161,ATL,NL,161,8,...,Travis d'Arnaud,2,urshg001,Giovanny Urshela,5,arcio002,Orlando Arcia,6,NaN,Y
10615,20240930,2,Mon,NYN,NL,162,ATL,NL,162,0,...,Giovanny Urshela,5,murps001,Sean Murphy,2,arcio002,Orlando Arcia,6,NaN,Y

In [155]:
# checking for missing values
all_data.isnull().sum()

Date                        0
DoubleHeader                0
DayOfWeek                   0
VisitingTeam                0
VisitingTeamLeague          0
                        ...
HomeBatting9PlayerID        0
HomeBatting9Name            0
HomeBatting9Position        0
AdditionalInfo          10524
AcquisitionInfo             0
Length: 161, dtype: int64

**Let's check if we actually have other years.**

In [156]:
all_data['Date'] = pd.to_datetime(all_data['Date'], format='%Y%m%d') # convert timestamp into datetime

# Check which years are in dataset
years = all_data['Date'].dt.year.unique()
print("Years in dataset:", years)

Years in dataset: [2020 2021 2022 2023 2024]

Seems like correct.